In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df_original = pd.read_csv('bershire_1_Hoja1.csv')

In [6]:
df_copy = df_original.fillna(0)

In [7]:
df_copy['Year'] = df_copy['Unnamed: 0'].str[-4:]

In [8]:
del df_copy['Unnamed: 0']

In [9]:
df_prueba_for_year = pd.DataFrame()

for row in range(0,df_copy.shape[0]):
    temporan_df = pd.DataFrame()
    temporan_df = df_copy.iloc[row:row+1,:-1].transpose().reset_index()
    temporan_df['Year'] = df_copy.iloc[row]['Year']
    temporan_df.rename(columns={'index':'Company', row:'Amount'}, inplace=True)
    df_prueba_for_year = pd.concat([df_prueba_for_year, temporan_df], ignore_index= True)
    temporan_df = pd.DataFrame()

In [10]:
df_prueba_for_year.to_csv('list_tablue_stock.csv')

In [11]:
df_copy['Total'] = df_copy.iloc[:,:-1].sum(axis=1)

In [12]:
prueba_2 = df_copy.copy()
prueba_2.head()

,Apple,HP,Activision Blizzard,Occidental Petroleum,Bank of America,Coca-Cola,Others,American Express,Kraft Foods,Verizon,...,AT&T,Delta Airlines,Southwest Airlines,United Continental Holdings,Verisign,ITOCHU,Mitsubishi,Mitsui & Co.,Year,Total
0,0.0,0.0,0.0,0,0.0,5150.0,2458.2,818.9,0.0,0.0,...,0,0,0,0,0.0,0,0,0,1994,15236.5
1,0.0,0.0,0.0,0,0.0,7425.0,2655.4,2046.3,0.0,0.0,...,0,0,0,0,0.0,0,0,0,1995,22000.3
2,0.0,0.0,0.0,0,0.0,10499.7,3862.1,2731.8,0.0,0.0,...,0,0,0,0,0.0,0,0,0,1996,27551.6
3,0.0,0.0,0.0,0,0.0,13305.0,6526.0,4315.0,0.0,0.0,...,0,0,0,0,0.0,0,0,0,1997,35941.0
4,0.0,0.0,0.0,0,0.0,13368.0,8629.0,5067.0,0.0,0.0,...,0,0,0,0,0.0,0,0,0,1998,39494.0

In [13]:
df_porcent = pd.DataFrame()
for row in range(len(prueba_2)):
    temporal = pd.DataFrame()
    temporal = prueba_2.iloc[row:(row+1), :-2] / prueba_2.loc[row]['Total']
    temporal['Year'] = prueba_2.loc[row]['Year']
    df_porcent = pd.concat([df_porcent, temporal], ignore_index=True)
    temporal = pd.DataFrame()

In [14]:
df_renew = pd.DataFrame()
for row in range(len(df_porcent)):
    temporal_df = pd.DataFrame()
    temporal_df = df_porcent.iloc[row:row+1,:-1].transpose().reset_index()
    temporal_df.rename(columns={'index': 'Company', row:'Participation'}, inplace=True)
    temporal_df['Year'] = df_porcent.loc[row]['Year']

    df_renew = pd.concat([df_renew, temporal_df], ignore_index=True)

In [15]:
df_renew.to_csv('stok_percent.csv')

In [16]:
df_renew.head()

                Company  Participation  Year
0                 Apple            0.0  1994
1                    HP            0.0  1994
2   Activision Blizzard            0.0  1994
3  Occidental Petroleum            0.0  1994
4       Bank of America            0.0  1994

In [17]:
df_prueba_for_year['Participation'] = df_renew['Participation']

In [18]:
df_prueba_for_year.to_csv('data_percent.csv')

In [19]:
prueba_2.iloc[0:1,:-2] / prueba_2.loc[0]['Total']

,Apple,HP,Activision Blizzard,Occidental Petroleum,Bank of America,Coca-Cola,Others,American Express,Kraft Foods,Verizon,...,Goldman Sachs,Deere,AT&T,Delta Airlines,Southwest Airlines,United Continental Holdings,Verisign,ITOCHU,Mitsubishi,Mitsui & Co.
0,0.0,0.0,0.0,0.0,0.0,0.338004,0.161336,0.053746,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [20]:
range(len(prueba_2))

range(0, 29)